### Pandas
- PANel DAta
- Multidimeneisonal data
- high performance on data manipulation and analysis tool

#### Data structures in Python Pandas
- Series 
    - similar to numpy array
    - create a pandas series
        - series is a 1D array and holds data types like int,float and strings
    - indexing series
- DataFrames
    - creating data frames from dictionaries,lists, JSON objects,CSV files
    - importing CSV data files as pandas dataframes
    - Reading, summarising and sorting data frames

In [1]:
import pandas as pd

In [ ]:
! pip install pandas

In [2]:
s = pd.Series([1,2,3])
s

0    1
1    2
2    3
dtype: int64

In [3]:
se = pd.Series(['a','bn','hj'])
se

0     a
1    bn
2    hj
dtype: object

In [4]:
i = pd.Series([1,2,3],index=[67,68,80])
i

67    1
68    2
80    3
dtype: int64

In [8]:
d = pd.Series([1,2,3],index=['a','b','c'])
print(d)

a    1
b    2
c    3
dtype: int64

In [9]:
dr = pd.Series([22,23,45],index=pd.date_range('22-11-2020','24-11-2020'))
dr

2020-11-22    22
2020-11-23    23
2020-11-24    45
Freq: D, dtype: int64

In [11]:
import numpy as np
n = pd.Series(np.array(range(1,10))*3, index= range(1,10))
n

1     3
2     6
3     9
4    12
5    15
6    18
7    21
8    24
9    27
dtype: int32

In [5]:
data = [['anusha',12],['harshini',23],['harshith',56]]
df = pd.DataFrame(data,columns=['name','age'])
df

       name  age
0    anusha   12
1  harshini   23
2  harshith   56

In [14]:
i1 = {"fruit":10,"flowers":"rose","birds":89}
i2 = {"a":1,"b":2,"c":3}
i1 = pd.Series(i1)
i2 = pd.Series(i2)
print(i1)
i2

fruit        10
flowers    rose
birds        89
dtype: object

a    1
b    2
c    3
dtype: int64

In [15]:
f = {"first":i1,"second":i2}
df1 = pd.DataFrame(f)
df1

        first  second
a         NaN     1.0
b         NaN     2.0
birds      89     NaN
c         NaN     3.0
flowers  rose     NaN
fruit      10     NaN

In [17]:
d1 = {"A":1,"b":2,"c":3,"d":134}
d2 = {"A":67,"b":"python","c":"k"}
d = {"dict1":d1,"dict2":d2}
df = pd.DataFrame(d)
df

   dict1   dict2
A      1      67
b      2  python
c      3       k
d    134     NaN

In [18]:
li1 = pd.Series([1,2,3,4,5])
li2 = pd.Series(["abv","hi","hello"])

data = {"data1":li1,"data2":li2}
df = pd.DataFrame(data)
df

   data1  data2
0      1    abv
1      2     hi
2      3  hello
3      4    NaN
4      5    NaN

In [19]:
d1 = [[1,2,3],[4,5,6]]
d2 = [["a","b",67.8],[90,23,45]]

data = {"list1":d1,"list2":d2}
df = pd.DataFrame(data)
df

       list1         list2
0  [1, 2, 3]  [a, b, 67.8]
1  [4, 5, 6]  [90, 23, 45]

In [24]:
di1 = {"days":["monday","tuesday","wednesday","thursday","friday","saturday"],"date":[11,12,13,14,15,16]}
df = pd.DataFrame(di1)
df

        days  date
0     monday    11
1    tuesday    12
2  wednesday    13
3   thursday    14
4     friday    15
5   saturday    16

In [25]:
df.head(2)

      days  date
0   monday    11
1  tuesday    12

In [26]:
df.tail()

        days  date
1    tuesday    12
2  wednesday    13
3   thursday    14
4     friday    15
5   saturday    16

In [34]:
m1 = pd.DataFrame({"employees":["abc","name","hi","hello"],"empid":[1,2,3,4]},index=[123,124,125,126])
m2 = pd.DataFrame({"employees":["abc","klm","hi","hello"],
                   "empid":[1,2,3,5]},index=[12,18,1,16])

m = pd.merge(m1,m2) # column values have to match in both dataframes
m

  employees  empid
0       abc      1
1        hi      3

In [37]:
r = m1.rename(columns={"empid":"employeeid"})
r

    employees  employeeid
123       abc           1
124      name           2
125        hi           3
126     hello           4

In [35]:
c = pd.concat([m1,m2])
c

    employees  empid
123       abc      1
124      name      2
125        hi      3
126     hello      4
12        abc      1
18        klm      2
1          hi      3
16      hello      5

In [31]:
import pandas as pd
m1 = pd.DataFrame({"employees":["abc","name","hi","hello"],
                   
                   "empid":[1,2,3,4]},index=[123,124,125,126])
m2 = pd.DataFrame({"animals":["lion","tiger","girafee","gorilla"],
                   "birds":["eagle","crow","parrot","pigeon"]},
                  index = [123,124,129,189])
j = m1.join(m2) # index values should be matched
j

    employees  empid animals  birds
123       abc      1    lion  eagle
124      name      2   tiger   crow
125        hi      3     NaN    NaN
126     hello      4     NaN    NaN

In [42]:
d = {"day":[1,2,3,4],"inpatient":[12,15,17,18],"outpatient":[19,10,17,11]}
df = pd.DataFrame(d)
df.set_index("day",inplace=True)
df

     inpatient  outpatient
day
1           12          19
2           15          10
3           17          17
4           18          11

In [43]:
df.describe()

       inpatient  outpatient
count   4.000000    4.000000
mean   15.500000   14.250000
std     2.645751    4.425306
min    12.000000   10.000000
25%    14.250000   10.750000
50%    16.000000   14.000000
75%    17.250000   17.500000
max    18.000000   19.000000